#ifndef FLIGHTC_H
#define FLIGHTC_H 

class Flight
{
private:
// από τον προορισμό της,

// την ώρα αναχώρησης από το αεροδρόμιο,

// την διάρκεια της πτήσης και 

// το μέγιστο αριθμό επιβατών σε κάθε θέση (θέσεις Α και Β).

public:
    // Μια πτήση αρχικοποιείται με όλες τις παραπάνω παραμέτρους. 
    Flight();

// Μια πτήση δέχεται μια αίτηση και αν ο αντίστοιχος επιβάτης χωράει στο αεροπλάνο,
//τον προσθέτει (σαν κλεισμένη θέση) ( add passenger ). 

// Δίδοντας ένα id επιβάτη, μπορούμε να ακυρώσουμε όλες τις κλεισμένες θέσεις για 
//αιτήσεις με το συγκεκριμένο id ( cancel reservations ).

// Μπορούμε να ανακτήσουμε την ώρα αναχώρησης της πτήσης ( departs at ).

// Μπορούμε να ανακτήσουμε την ώρα άφιξης της πτήσης στον προορισμό της ( arrives at ).

// Μπορούμε να ανακτήσουμε τον προορισμό της πτήσης ( get destination ).

// Μπορούμε να ανακτήσουμε τον αριθμό των διαθέσιμων θέσεων της πτήσης 
// (ανεξαρτήτως θέσης Α ή Β) ( get available ).

// Μπορούμε να ανακτήσουμε μια δομή με τις αιτήσεις που έχουν κλειστεί στην 
// συγκεκριμένη πτήση ( get bookings ).

};

#endif